Semester 5/Mobile Applications/lab05/server/app/controllers/exercises_controller.rb

INSERT INTO "exercises" ("name", "description", "category", "primary_muscle", "secondary_muscles", "equipment", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
    def create
        @exercise = Exercise.new(exercise_params)

        if @exercise.save

UPDATE "exercises" SET "name" = ?, "image" = ?, "updated_at" = ? WHERE "exercises"."id" = ?  [["name", "eef"], ["image", ""], ["updated_at", "2023-12-17 00:27:36.963265"], ["id", 9]]
---
    def update
        if @exercise.update(exercise_params)

DELETE FROM "exercises" WHERE "exercises"."id" = ?  [["id", 2]]
---
    def destroy
        @exercise.destroy

SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        def set_exercise
            @exercise = Exercise.find(params[:id])